umartechboy/MarlinD6500/Marlin/src/HAL/ESP32/HAL.cpp
  #ifdef USE_ESP32_PCF8574
    InitIOExpanders();
  #endif

  Preferences prefs;
  prefs.begin("machine");
  hasJoyStick = prefs.getBool("joystick", false);
  PerMachineProbePressureCompensation = prefs.getFloat("probe_p", 0);
  FloatingFactor = prefs.getFloat("probe_f", 0.002F);
  prefs.end();
  SERIAL_IMPL.print("Control set to: ");
  SERIAL_IMPL.println(hasJoyStick?"Joystick":"Touchpad");
  SERIAL_IMPL.println("Starting SD to look for PLR");
  if(!card.isMounted()){
    card.mount();
  }

  if (recovery.exists()){
    SERIAL_IMPL.println("Loading recovery");
    recovery.load();
    if (recovery.valid()){
      SERIAL_IMPL.println("Valid Recovery loaded");
      mainScreenStep.printStatus = PrintStatus::PrintToRecover;      
      SERIAL_IMPL.printf("File Name: %s\n", recovery.info.sd_filename);
      SERIAL_IMPL.printf("SD Pos: %d\n", recovery.info.sdpos);
      SERIAL_IMPL.printf("X offset: %f\n", recovery.info.home_offset.x);
      SERIAL_IMPL.printf("Y offset: %f\n", recovery.info.home_offset.y);
      SERIAL_IMPL.printf("Z offset: %f\n", recovery.info.home_offset.z);
      SERIAL_IMPL.printf("X shift: %f\n", recovery.info.position_shift.x);
      SERIAL_IMPL.printf("Y shift: %f\n", recovery.info.position_shift.y);
      SERIAL_IMPL.printf("Z shift: %f\n", recovery.info.position_shift.z);
      SERIAL_IMPL.printf("Active Extrder: %d\n", recovery.info.active_extruder);
      SERIAL_IMPL.printf("Elapsed: %d\n", recovery.info.print_job_elapsed);
    }
    else {
      SERIAL_IMPL.println("Recovery not valid");
    }
  }
  else {
    SERIAL_IMPL.println("No Recovery Data");
    delay(1);
  }
  
  #if ENABLED(USE_ESP32_TASK_WDT)
    esp_task_wdt_init(10, true);
  #endif
  #if ENABLED(ESP3D_WIFISUPPORT)
    //esp3dlib.init();
  #endif
  SERIAL_IMPL.println("Hal init done");
  delay(1);
}

void GcodeSuite::M39() {
  if (parser.seen('P')){
    PerMachineProbePressureCompensation = parser.value_float();
    Preferences prefs;
    prefs.begin("machine");
    prefs.putFloat("probe_p", PerMachineProbePressureCompensation);
    prefs.end();
  }
  else if (parser.seen('F')){
    FloatingFactor = parser.value_float();
    Preferences prefs;
    prefs.begin("machine");
    prefs.putFloat("probe_f", FloatingFactor);
    prefs.end();
  }
  SERIAL_IMPL.printf("Using: PComp = %f, FFac = %f\n", PerMachineProbePressureCompensation, FloatingFactor);
}
volatile int16_t adcCache[4] = {26000, 26000, 26000, 26000};
volatile bool needsConversion[4] = {0, 0, 0, 0};

 // All displays share the MarlinUI class
 #include "..\..\lcd\marlinui.h"
 extern MarlinUI ui;
 

long lastLoadCellLoop = 0;
void MarlinHAL::idletask() {
  //SERIAL_IMPL.println("update_buttons Idle()");
  //ui.update_buttons();
  if (millis() - lastLoadCellLoop > 13) {// < 80hz
    lastLoadCellLoop = millis();
    LoadCellLoop();
  }
#ifdef USE_ESP32_PCF8574
  static long lastPCFSync = 0;
  if (millis() - lastPCFSync >= 1) { // at most 1khz
    lastPCFSync = millis();
    if (xSemaphoreTake(xPCFIOMutex, 0)) {
      pcf1_write_pending = true;
      pcf2_write_pending = true; // refresh PCF in case it has reset due to a brown out.
      PCFSync();
      xSemaphoreGive(xPCFIOMutex);
    }
  }
#endif
  UILoop();
  #if BOTH(WIFISUPPORT, OTASUPPORT)
    OTA_handle();
  #endif
  TERN_(ESP3D_WIFISUPPORT, esp3dlib.idletask());

  #if ENABLED(M3DPrintVueSupport)
    M3DPrintVueLoop();
  #endif
  // for (int i = 0; i < 4; i++){
  //   if (needsConversion[i]){
  //     int16_t newVal = ads.readADC_SingleEnded(i) * 0.03875;
  //     if (abs(newVal - adcCache[i]) > 50){
  //       adcCache[i] = ((long)(newVal * 5 + adcCache[i] * 95)) / 100;  
  //     }
  //     else{
  //       adcCache[i] = newVal;
  //       needsConversion[i] = false;
  //     }
  //     //SERIAL_IMPL.println(adcCache[i]);
  //   }
  // }
  
  ui.update_buttons();
  
}

uint8_t MarlinHAL::get_reset_source() { return rtc_get_reset_reason(1); }

void MarlinHAL::reboot() { ESP.restart(); }

void _delay_ms(int delay_ms) { delay(delay_ms); }

// return free memory between end of heap (or end bss) and whatever is current
int MarlinHAL::freeMemory() { return ESP.getFreeHeap(); }

// ------------------------
// Watchdog Timer
// ------------------------
#if ENABLED(USE_WATCHDOG)

  #define WDT_TIMEOUT_US TERN(WATCHDOG_DURATION_8S, 8000000, 4000000) // 4 or 8 second timeout

  extern "C" {
    bool heaterPinsEnabled = true;
    void disableHeaterPins(){
      heaterPinsEnabled = false;
      delay(1); // confirms we are outside pcf writes that takes 200us
    }
    void enableHeaterPins(){
      heaterPinsEnabled = true;
    }
    esp_err_t esp_task_wdt_reset();
  
    // Declare original weak functions from the ESP32 core
    extern void __digitalWrite(uint8_t pin, uint8_t val);
    extern int  __digitalRead(uint8_t pin);
    //extern uint16_t __analogRead(uint8_t pin);
  #ifdef USE_ESP32_PCF8574
    // Override digitalWrite / digitalRead only when PCF8574 expander pins are in use.
    void digitalWrite(uint8_t pin, uint8_t val) {
      if (pin >= 200 && pin < 216) {
        const uint8_t bit = pin - 200;

        if (((pcfWriteMapConfirmed >> bit) & 1) == val) return; // already up to date

        if (val) pcfMapToSync |= (1 << bit);
        else     pcfMapToSync &= ~(1 << bit);

        if (bit < 8) pcf1_write_pending = true;
        else         pcf2_write_pending = true;

        if (PCFIsBusy) {
          if ((1 << bit) & lockedBits) PCFSync(true);
          return;
        }

        if (xPortInIsrContext()) {
          if (pcfTaskHandle != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            vTaskNotifyGiveFromISR(pcfTaskHandle, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
          }
          return;
        }

        if (xSemaphoreTake(xPCFIOMutex, portMAX_DELAY)) {
          PCFSync();
          xSemaphoreGive(xPCFIOMutex);
        }
        return;
      }
      __digitalWrite(pin, val);
    }

    int digitalRead(uint8_t pin) {
      if (pin >= 200 && pin < 216) {
        const uint8_t bit = pin - 200;

        if (bit < 8) pcf1_read_pending = true;
        else         pcf2_read_pending = true;

        if (PCFIsBusy) {
          if ((1 << bit) & lockedBits) PCFSync(true);
          return (pcfReadCache >> bit) & 1;
        }

        if (xPortInIsrContext()) {
          if (!PCFSync() && pcfTaskHandle != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            vTaskNotifyGiveFromISR(pcfTaskHandle, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
          }
        }
        else if (xSemaphoreTake(xPCFIOMutex, portMAX_DELAY)) {
          PCFSync();
          xSemaphoreGive(xPCFIOMutex);
        }

        return (pcfReadCache >> bit) & 1;
      }
      return __digitalRead(pin);
    }
  #endif // USE_ESP32_PCF8574
} // extern "C"
  

